[
    {
        "day": 1,
        "id": "11",
        "name": "Mr. John Harvey D. Gamas, MA",
        "position": "Assistant Professor IV, International Studies Department, Ateneo de Davao University",
        "imageUrl": "/images/speakers/Gamas.jpg",
        "bionote": "John Harvey D. Gamas is assistant professor of the International Studies Department, Ateneo de Davao University. He previously served as chair of the said department from 2015-2023 and is currently the managing editor of Tambara. He earned his bachelor's degree in International Studies, major in Asian Studies and minor in Philosophy, Magna Cum Laude, from the same institution. He obtained his Master of Arts in International Studies, major in European Studies, from De La Salle University. In 2017, he was selected by the US State Department to attend the Study of the United States Institute (SUSI) on US Foreign Policy at Bard College, New York. He is a member of the board of trustees and Vice President for Conferences of the Philippine International Studies Organization (PHISO). He is also a member of the Board of Trustees of the European Studies Association of the Philippines (ESAP) and the Asian Studies Association of the Philippines (AsiaPhil). His research interest focuses on Non-Western International Relations, international history, Southeast Asian and Mindanao Studies."
        
    },
    {
        "day": 1,
        "id": "12",
        "name": "Mr. Nassef Manabilang Adiong, PhD",
        "position": "Director II, Policy Research and Legal Services \n BARMM Bangsamoro Transition Authority Professional Lecturer III, Asian Center, University of the Philippines - Diliman",
        "imageUrl": "/images/speakers/Adiong.png",
        "bionote": "Nassef Manabilang Adiong is the founder of four academic network associations (International Relations and Islamic Studies Research Cohort, Philippine International Studies Organization, Decolonial Studies Research Network, and the Bangsamoro Research and Legal Network); the founding Chief Editor of International Journal of Islam in Asia (Brill Publishers), Islam and Global Studies series (Springer), International Relations in Southeast Asia series (Routledge), Islam in Southeast Asia series (Palgrave Macmillan), Islam in the Philippines series (IIUM Press), and Islam and International Relations series (Gerlach Press); edited The Contemporary World (2023), International Studies in the Philippines: Mapping New Frontiers in Theory and Practice (2022, 2020), Islam in International Relations: Politics and Paradigms (2018), Islam and International Relations: Contributions to Theory and Practice (2016), and International Relations and Islam: Diverse Perspectives (2013); authored Decolonizing Religion: Wishful Thinking or a Real Possibility (2023), The Indigenous Peoples’ Rights in the Bangsamoro Local Governance Code (2023), Decolonial Approaches to Legislation in the Bangsamoro Context (2023), Bangsamoro Local Government Code: Re-reading of Decentralization and its Problems (2023), Principles and Practice of Moral Governance in the Bangsamoro (2021), The Irony of Systemic Racism in the GlobalSouth Academy: How ‘Othering’ Perpetuates the Western Colonisation of Knowledge (2021), The Evolution of Islamic Education in the Philippines (2020), Muslim Governance and Salafi Orthodoxy (2020), Muslim Views of the Polity: Citizenry, Authority, Territoriality, and Sovereignty (2019), Salafiyyah in the Philippines (2019), among others; reviewer of select legislations (both the congress and BARMM Parliament) and articles of Journal of Law and Religion (Cambridge University Press), Foreign Policy Analysis (Oxford University Press), Critical Research on Religion (SAGE Publications), Millennium: Journal of International Studies (SAGE Publications), Sociological Research Online (SAGE), Third World Quarterly (Routledge), NRCP Research Journal (DOST-NRCP), Asian Journal of Women’s Studies (Routledge), Kritika Kultura (Ateneo de Manila University), etcetera; editorial board member of Global Studies Quarterly (Oxford University Press), Sociological Research Online (SAGE), Mathal: A Journal of Islamic and Middle Eastern Multidisciplinary Studies (The University of Iowa), International Journal of Religion (Transnational Press London), and so forth; a recipient of 2022 Noam Chomsky Global Connections Emerging Scholar Award, 2021 BTA-BARMM legislative commendation, 2020-2022 UP Scientist III, 2020 UP Diliman Centennial Professorial Chair, 2018 TOYM honoree, 2017 PUP Professorial Chairholder, etcetera; and presently the Director of the Bangsamoro Parliament’s Policy Research and Legal Services as well as Professorial Lecturer at UP Diliman’s Asian Center and Miriam College’s International Studies department. For inquiries and information, contact Nassef at https://nassef.info/."
    }
]