[
    {
        "id": 1,
        "name": "Mr. Lucio Blanco Pitlo III, MA",
        "position": "President, Philippine Association for Chinese Studies \n Research Fellow, Asia-Pacific Pathways to Progress Foundation",
        "imageUrl": "/images/speakers/Pitlo.jpg",
        "bionote": "Lucio Blanco Pitlo III is a foreign policy and security analayst. He is the President of the Philippine Association for Chinese Studies and a Research Fellow at the Asia-Pacific Pathways to Progress Foundation. \n He was a Taiwan Fellow and a Visiting Scholar at the National Chengchi University Department of Diplomacy and Center for Foreign Policy Studies in Taipei. He was a lecturer at the Chinese Studies Program of the Ateneo de Manila University and the International Studies Department of De La Salle University. \n Mr. Pitlo was formerly a technical assistant with the National Coast Watch Council Secretariat, now known as the Presidential Office for Maritime Concerns. He also served as a research associate and consultant for several projects on maritime issues and Philippine foreign policy. \n He obtained his Master of Laws from Peking University. His commentaries and analyses on Philippine security and foreign policy and Southeast Asian affairs appear in the South China Morning Post, China-US Focus, Asia Times, CSIS Asia Maritime Transparency Initiative, and The Diplomat."
    },
    {
        "id": 2,
        "name": "Atty. Archill Niña Faller-Capistrano",
        "position": "Assistant Professor, University of the Philippines - Cebu",
        "imageUrl": "/images/speakers/Capistrano.png",
        "bionote": "Archill Niña Faller-Capistrano is an assistant professor of political science at the University of the Philippines Cebu and serves as coordinator of the Office of Anti-Sexual Harassment (OASH). Under her leadership, OASH conducted the First Responders’ Drill on Anti-Sexual Harassment (#ASH1st2022) which earned UP Cebu a Special Citation on Gender Mainstreaming in the Education Sector awarded by the Philippine Commission on Women and by the National Anti-Poverty Commission in October 2022. \n In 2022-2023, Archill served as president of the Philippine International Studies Organization (PHISO), the pioneering professional organization dedicated to the promotion of International Relations as well as the interdisciplinary scholarship of the “international” from the Global South perspective. Her research interests include liquid modernity, human trafficking, gender, and human rights in international relations."
    },
    
    {
        "id": 3,
        "name": "Dr. Manuel R. Enverga III",
        "position": "Director of European Studies Program, Ateneo de Manila University",
        "imageUrl": "/images/speakers/Enverga.jpg",
        "bionote": "Dr. Manuel R. Enverga III is the Director of Ateneo de Manila University's European Studies Program, and is the first Philippine academic to have been conferrred the prestigious Jean Monnet Chair in European Studies by the European Union. The distinction is awarded to academics who have made recognizable contributions to research and teaching in the field of European Studies. His teaching and research includes topics on EU-Philippine relations, digital diplomacy, and global flows. His academic publications have appeared in prominent specialist journals, such as the International Journal of Cultural Policy, Place Branding and Public Diplomacy, and the Journal of Contemporary European Studies. Outside of his academic work, Dr. Enverga also shares his expertise by writing articles for mainstream media publications, providing insights on television news, or conducting workshops, seminars, or lectures for international organizations, diplomats, multinational companies, or Philippine government agencies. Outside of his academic work, he hosts The Eurospeak Podcast, where he and his guests to talk about European influences on contemporary popular culture."
    }
]