[
    {
        "day": 1,
        "id": "11",
        "name": "Mr. John Harvey D. Gamas, MA",
        "position": "Assistant Professor IV, International Studies Department, Ateneo de Davao University",
        "imageUrl": "/images/speakers/Gamas.jpg",
        "bionote": "John Harvey D. Gamas is an Assistant Professor of the International Studies Department, Ateneo de Davao University. He previously served as chair of the said department from 2015-2023 and is currently the managing editor of Tambara. He earned his bachelor's degree in International Studies, major in Asian Studies and minor in Philosophy, Magna Cum Laude, from the same institution. He obtained his Master of Arts in International Studies, major in European Studies, from De La Salle University. In 2017, he was selected by the US State Department to attend the Study of the United States Institute (SUSI) on US Foreign Policy at Bard College, New York. He is a member of the board of trustees and Vice President for Conferences of the Philippine International Studies Organization (PHISO). He is also a member of the Board of Trustees of the European Studies Association of the Philippines (ESAP) and the Asian Studies Association of the Philippines (AsiaPhil). His research interest focuses on Non-Western International Relations, international history, Southeast Asian and Mindanao Studies."
        
    },
    {
        "day": 1,
        "id": "12",
        "name": "Mr. Nassef Manabilang Adiong, PhD",
        "position": "Director II, Policy Research and Legal Services \n BARMM Bangsamoro Transition Authority Professional Lecturer III, Asian Center, University of the Philippines - Diliman",
        "imageUrl": "/images/speakers/Adiong.png",
        "bionote": "Nassef Manabilang Adiong is the founder of four academic network associations (International Relations and Islamic Studies Research Cohort, Philippine International Studies Organization, Decolonial Studies Research Network, and the Bangsamoro Research and Legal Network); the founding Chief Editor of International Journal of Islam in Asia (Brill Publishers), Islam and Global Studies series (Springer), International Relations in Southeast Asia series (Routledge), Islam in Southeast Asia series (Palgrave Macmillan), Islam in the Philippines series (IIUM Press), and Islam and International Relations series (Gerlach Press); authored Decolonizing Religion: Wishful Thinking or a Real Possibility (2023), The Indigenous Peoples’ Rights in the Bangsamoro Local Governance Code (2023), Decolonial Approaches to Legislation in the Bangsamoro Context (2023), The Irony of Systemic Racism in the Global South Academy: How ‘Othering’ Perpetuates the Western Colonisation of Knowledge (2021), The Evolution of Islamic Education in the Philippines (2020), Muslim Views of the Polity: Citizenry, Authority, Territoriality, and Sovereignty (2019), among others; reviewer of select legislations (both the congress and BARMM Parliament) and articles of Journal of Law and Religion (Cambridge University Press), Foreign Policy Analysis (Oxford University Press), Critical Research on Religion (SAGE Publications), Millennium: Journal of International Studies (SAGE Publications), Sociological Research Online (SAGE), Third World Quarterly (Routledge), NRCP Research Journal (DOST-NRCP), Asian Journal of Women’s Studies (Routledge), Kritika Kultura (Ateneo de Manila University), etc.; and presently the Director of the Bangsamoro Parliament’s Policy Research and Legal Services as well as Professorial Lecturer at UP Diliman’s Asian Center and Miriam College’s International Studies department."
    },
    {
        "day": 1,
        "id": "13",
        "name": "Mr. Mansoor L. Limba, PhD, SCL",
        "position": "Associate Professor, Islamic Studies Department, Ateneo de Davao University",
        "imageUrl": "/images/speakers/Limba.png",
        "bionote": "Mansoor L. Limba, PhD, SCL is an Associate Professor of Islamic Studies at Ateneo de Davao University and a Shari‘ah Counselor-at-Law. He is a dedicated scholar of international politics, Islamic studies, and interfaith dialogue. He is recognized in the AD Scientific Index as among the Top 5 scholars at Ateneo de Davao and among the Top 15 in the Philippines in the fields of History, Philosophy, and Theology. Moreover, he was awarded the prestigious 13th International Farabi Award in 2022 in Humanities and Islamic Studies and has served as the Fellows Programme Regional Coordinator for South and Southeast Asia at the King Abdullah bin Abdulaziz International Centre for Interreligious and Intercultural Dialogue (KAICIID). He has been a featured speaker at numerous forums and events, where he has provided valuable insights on the Palestinian Question. Our speaker is also the author of “The Power of International Quds Day in Cyberspace,” and is actively involved in areas such as conflict resolution, legal pluralism, and Islamic personal finance. Beyond the academia, he is a publisher-entrepreneur and a strong advocate for financial education, the halal industry, and youth development through chess."
    }
]